<?php

namespace losthost\BlagoBot\service;

class AIFunctionReportObjectsByActivity extends AIFunctionReport {

    const ACTIVITY_IDS = [
        "Зоны для досуга и отдыха в парках" => 1,
        "Детские скверы Нацпроект" => 2,
        "ОТ Нацпроект 2026" => 3,
        "ОТ Нацпроект 2024" => 4,
        "ОТ Нацпроект 2025" => 5,
        "Скверы Нацпроект 2025" => 6,
        "Скверы Нацпроект 2024" => 7,
        "Скверы Нацпроект 2026" => 8,
        "Конкурс 2023" => 9,
        "Конкурс 2024" => 10,
        "Стелы" => 11,
        "Лесопарки 2027" => 12,
        "Лесопарки 2025" => 13,
        "Лесопарки 2026" => 14,
        "Лесопарки 2024" => 15,
        "Велодорожки" => 16,
        "ИМБТ развитие парков 2024" => 17,
        "ИМБТ Парк Малевича" => 18,
        "ИМБТ развитие парков 2025" => 19,
        "ИМБТ Серпухов" => 20,
        "оз. Черное" => 21,
        "Аренда катков" => 22,
        "Катки" => 23,
        "Стелы 2024" => 24,
        "Аренда катков 2025" => 25,
        "Зоны отдыха в парках Нацпроект" => 26,
        "Велодорожки 2025" => 27,
        "Скверы Нацпроект 2027" => 28,
        "ОТ Нацпроект 2028" => 29,
        "Скверы Нацпроект 2028" => 30,
        "Лесопарки 2028" => 31,
        "ОТ Нацпроект 2027" => 32,
        "Конкурс 2025" => 33,
        "ОТ Нацпроект 2029" => 34,
        "Велодорожки 2026" => 35,
        "ИМБТ развитие парков 2026" => 36,
        "ОТ за дотацию" => 37,
        "Аренда катков 2026" => 38    
    ];

    const DATA_IDS = [
        "Разбивка по бюджетам" => 15, 
        "Опубликовано" => 16, 
        "Законтрактовано" => 17, 
        "Подано заявок на оплату" => 18, 
        "Оплачено" => 19, 
        "Остаток по итогам торгов" => 20, 
        "Остаток по итогам освоения" => 21 
    ];
    
    #[\Override]
    public function getResult(array $params): mixed {

        if (!is_array($params['year'])) {
            $params['year'] = [$params['year']];
        }

        $params['activity'] = array_map(function($value) {
            if (!isset(static::ACTIVITY_IDS[$value])) {
                throw new Exception("Не найдено соответствие для значения: $value");
            }
            return static::ACTIVITY_IDS[$value];
        }, $params['activity']);
        
        $params['data'] = array_map(function($value) {
            if (!isset(static::DATA_IDS[$value])) {
                throw new Exception("Не найдено соответствие для значения: $value");
            }
            return static::DATA_IDS[$value];
        }, $params['data']);
        
        
        $this->sendReport(2, $params);
        
        $result = "Запрошенный отчет отправлен.";

        return $result;
    }
}
