<?php

namespace losthost\BlagoBot\service;

class AIFunctionReportObjectsByOmsu extends AIFunctionReport {
    
    const OMSU_IDS = [
        "Балашиха" => 1, 
        "Богородский" => 2, 
        "Бронницы" => 3, 
        "Власиха" => 4, 
        "Волоколамский" => 5, 
        "Воскресенск" => 6, 
        "Восход" => 7,
        "Дзержинский" => 8, 
        "Дмитровский" => 9, 
        "Долгопрудный" => 10, 
        "Домодедово" => 11, 
        "Дубна" => 12, 
        "Егорьевск" => 13, 
        "Жуковский" => 14,
        "Зарайск" => 15, 
        "Звездный" => 16, 
        "Истра" => 17, 
        "Кашира" => 18, 
        "Клин" => 19, 
        "Коломна" => 20, 
        "Королёв" => 21, 
        "Котельники" => 22, 
        "Красногорск" => 23,
        "Краснознаменск" => 24, 
        "Ленинский" => 25, 
        "Лобня" => 26, 
        "Лосино-Петровский" => 27, 
        "Лотошино" => 28, 
        "Луховицы" => 29, 
        "Лыткарино" => 30,
        "Люберцы" => 31, 
        "Можайский" => 32, 
        "Молодёжный" => 33, 
        "Мытищи" => 34, 
        "Наро-Фоминский" => 35, 
        "Одинцовский" => 36, 
        "Орехово-Зуевский" => 37,
        "Павлово-Посадский" => 38, 
        "Подольск" => 39, 
        "Протвино" => 40, 
        "Пушкинский" => 41, 
        "Пущино" => 42, 
        "Раменский" => 43, 
        "Реутов" => 45, 
        "Рузский" => 46,
        "Сергиево-Посадский" => 47, 
        "Серебряные пруды" => 48, 
        "Серпухов" => 49, 
        "Солнечногорск" => 50, 
        "Ступино" => 51, 
        "Талдомский" => 52, 
        "Фрязино" => 53, 
        "Химки" => 54, 
        "Черноголовка" => 55, 
        "Чехов" => 56, 
        "Шатура" => 57, 
        "Шаховская" => 58, 
        "Щелково" => 59, 
        "Электросталь" => 60     
    ];

    const DATA_IDS = [
        "Разбивка по бюджетам" => 15, 
        "Опубликовано" => 16, 
        "Законтрактовано" => 17, 
        "Подано заявок на оплату" => 18, 
        "Оплачено" => 19, 
        "Остаток по итогам торгов" => 20, 
        "Остаток по итогам освоения" => 21 
    ];
    
    #[\Override]
    public function getResult(array $params): mixed {

        if (!is_array($params['year'])) {
            $params['year'] = [$params['year']];
        }

        $params['omsu'] = array_map(function($value) {
            if (!isset(static::OMSU_IDS[$value])) {
                throw new \Exception("Не найдено соответствие для значения: $value");
            }
            return static::OMSU_IDS[$value];
        }, $params['omsu']);
        
        $params['data'] = array_map(function($value) {
            if (!isset(static::DATA_IDS[$value])) {
                throw new \Exception("Не найдено соответствие для значения: $value");
            }
            return static::DATA_IDS[$value];
        }, $params['data']);
        
        
        $this->sendReport(3, $params);
        
        $result = "Запрошенный отчет отправлен.";

        return $result;
    }
}
